---
kind: method
id: M:Autodesk.Revit.DB.InternalDefinition.GetGroupTypeId
source: html/199faef4-b99b-47e5-aa16-d77d87c8e344.htm
---
# Autodesk.Revit.DB.InternalDefinition.GetGroupTypeId Method

Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs.

## Syntax (C#)
```csharp
public override ForgeTypeId GetGroupTypeId()
```